#include<iostream>
#include<vector>
#include<algorithm>

using namespace std;

// 슈퍼게임 개발자 오셀리의 게임 난이도 조절을 위한 실패율을 구하는 코드를 작성하자!
// 실패율 정의 : (스테이지에 도달 했으나 아직 클리어하지 못한 플레이어의 수) / (스테이지에 도달 한 플레이어의 수)
// 전체 스테이지 개수가 N, 게임을 이용하는 사용자가 현재 멈춰 있는 스테이지의 번호가 담긴 배열 stages가 주어질 때 실패율이
// 높은 스테이지부터 내림차순으로 스테이지의 번호가 담겨 있는 배열을 반환하도록 solution() 함수를 작성하세요.
// 제약조건
// 1. 스테이지 개수 N은 1 이상 500 이하의 자연수.
// 2. stages의 길이는 1 이상 200,000 이하
// 3. stages에는 1 이상 N + 1 이하의 자연수가 존재
//		-각 자연수는 사용자가 현재 도전 중인 스테이지 번호를 나타냄
//		-단 N + 1은 마지막 스테이지, 즉 N까지 클리어한 사용자를 나타냄
// 4. 만약 실패율이 같은 스테이지가 있다면 작은 번호의 스테이지가 먼저 오면 됨
// 5. 스테이지에 도달한 유저가 없는 경우 해당 스테이지의 실패율은 0으로 간주
vector<int> solution(int N, vector<int>stages)
{

}
int main()
{

}